Tekla Open API Reference for Tekla Structures 2025
LocalizeForm.Localization Property
 Gets the localization for the dialog.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Localization Localization { get; }
Public Shared ReadOnly Property Localization As Localization
	Get
Property Value
Type: Localization
See Also
Reference
LocalizeForm Class
Tekla.Structures.Dialog.UIControls Namespace